{
  "architectures": [
    "LlamaForCausalLMEagle3"
  ],
  "hidden_size": 3584,
  "intermediate_size": 18944,
  "num_attention_heads": 28,
  "num_key_value_heads": 4,
  "num_hidden_layers": 1,
  "vocab_size": 152064,
  "max_position_embeddings": 32768,
  "model_type": "llama",
  "torch_dtype": "float16",
  "use_cache": true
}